def bot_news_controller():
    """
    Случайный выбор типа события из 4х видов и вызов его
    :return:
    """
    pass


def send_auto_news():
    """
    Будет отправлять в чат сообщения о новостях
    :return:
    """


def common_messages():
    """
    Будет формирования основные сообщения по уже имеющимся данным по системам
    :return:
    """
    pass


def discounts():
    """
    Будет формировать сообщения по скидкам в системах
    :return:
    """
    pass


def up_access():
    """
    Будет повышать уровень доступа путем формирования запроса на update в БД и формировать сообщение о повышении доступа
    :return:
    """
    pass

