"""
В данном пакете собраны модули, выводящие статистику НЕ ЯВЛЯЮЩЕЙСЯ частью игрового процесса. Вывод осуществляется в чате
в виде графиков или текста. Сбор и запись статистической информации осуществляется в связанных с командами модулях,
а вывод статистики - тут

Соответственно в данном пакете отсутствует статистические выводы по экономической системе(они все в пакете economic_info)
т.к. данные выводы непосредственно связаны с игровым процессом, а не являются просто выводом обзорной информации
"""